app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts"  WHERE "carts"."user_id" = $1  [["user_id", 6]]
SELECT "products".* FROM "products" INNER JOIN "carts" ON "products"."id" = "carts"."product_id" WHERE "carts"."user_id" = $1  [["user_id", 6]]
---
  def index
    # in view
    # current_user.carts
    @cart_items=current_user.carts.map { |cart| cart.product }

INSERT INTO "carts" ("created_at", "product_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-05-06 04:53:14.576578"], ["product_id", 1], ["updated_at", "2015-05-06 04:53:14.576578"], ["user_id", 6]]
---
  def create
    # check params to see if you are getting the product_id
    # use current_user + product_id
    # create a new cart (cart item)
    # redriect them to cart index

    #{ cart: { product_id: "3"}}
    product_id = params[:cart][:product_id]
    Cart.create(user_id: current_user.id, product_id: product_id)